Repository: ThinkInAIXYZ/clawdhome
Catalog: ClawdHome/Stable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# user.detail.shared_folders.public_desc
source: 所有虾和你共享
en: Shared with all shrimps and you
zh_hant: 暫無定時任務

# user.detail.shared_folders.reveal
source: 在 Finder 中显示
en: Reveal in Finder
zh_hant: 等待 Gateway 連線後自動載入

# user.detail.shared_folders.title
source: 共享文件夹
en: Shared Folders
zh_hant: 正在重啟 Gateway，配置將在重啟後生效…

# user.detail.shared_folders.vault
source: 安全文件夹
en: Vault Folder
zh_hant: 選擇一個任務

# user.detail.shared_folders.vault_desc
source: 仅你和这只虾可访问
en: Only you and this shrimp can access
zh_hant: 啟動 Gateway 依賴該使用者私有目錄中的 node/npm/npx。\n\n將執行基礎環境修復，完成後你可以手動再次啟動。

# user.detail.sidebar.agent_section
source: 当前角色
en: Current Agent
zh_hant: 檢測到 Node.js 環境缺失

# user.detail.sidebar.instance_section
source: 实例
en: Instance
zh_hant: 關閉

# user.detail.skills.no_skills
source: 暂无 Skills
en: No Skills
zh_hant: 當前步驟：%@

# user.detail.skills.remove
source: 卸载
en: Uninstall
zh_hant: 修復中…

# user.detail.skills.remove_confirm
source: 卸载 %@？
en: Uninstall %@?
zh_hant: 修復進度：%d/4

# user.detail.skills.update
source: 更新
en: Update
zh_hant: 觸發原因：%@

# user.detail.version.update_badge
source: 有新版本
en: Update available
zh_hant: 再次啟動 Gateway

# user.list.gateway.node_missing.message
source: 将执行基础环境修复。修复完成后，请手动点击“再次启动 Gateway”。
en: We will run a base environment repair. After completion, click "Start Gateway again" manually.
zh_hant: 開始修復

# user.list.gateway.node_missing.title
source: 检测到 Node.js 环境缺失
en: Node.js environment missing
zh_hant: 內建模型配置（Kimi / MiniMax / Qiniu / Z.AI）

# user.list.gateway.repair.close
source: 关闭
en: Close
zh_hant: 升級 openclaw (v%@)

# user.list.gateway.repair.current_step
source: 当前步骤：%@
en: Current step: %@
zh_hant: 記憶體

# user.list.gateway.repair.in_progress
source: 修复中…
en: Repairing…
zh_hant: 列表

# user.list.gateway.repair.progress
source: 修复进度：%d/4
en: Repair progress: %d/4
zh_hant: 樹狀

# user.list.gateway.repair.reason
source: 触发原因：%@
en: Trigger reason: %@
zh_hant: 公共資料夾

# user.list.gateway.repair.retry_start
source: 再次启动 Gateway
en: Start Gateway again
zh_hant: 所有蝦和你共享

# user.list.gateway.repair.start
source: 开始修复
en: Start repair
zh_hant: 在 Finder 中顯示

# utils.custom_model.http_error
source: 模型列表请求失败：HTTP %d
en: Model list request failed: HTTP %d
zh_hant: 共享資料夾

# utils.custom_model.invalid_base_url
source: Base URL 无效，无法拉取模型列表
en: Invalid Base URL, cannot fetch model list
zh_hant: 安全資料夾

# utils.custom_model.no_response
source: 模型列表请求失败：无响应状态
en: Model list request failed: no response status
zh_hant: 僅你和這隻蝦可訪問

# vault_files.error_title
source: 操作失败
en: Operation Failed
zh_hant: 當前角色

# vault_files.public_folder
source: 通用全局知识库
en: Universal Knowledge Base
zh_hant: 例項

# vault_files.subtitle
source: 专属安全空间 — 虾之间数据互不可见，您决定每只虾能接触哪些文件。产出物一键在 Finder 中查阅，文件交换尽在掌握
en: Exclusive secure space — data between shrimps is isolated. You decide which files each shrimp can access.
zh_hant: 暫無 Skills

# vault_files.title
source: 文件共享
en: File Sharing
zh_hant: 解除安裝

# views.app_lock_screen.admin_password
source: 管理密码
en: Admin Password
zh_hant: 解除安裝 %@？

# views.app_lock_screen.clawdhome_locked
source: ClawdHome 已锁定
en: ClawdHome Locked
zh_hant: 更新

# views.app_lock_screen.enter_admin_password_continue
source: 请输入管理密码以继续
en: Enter admin password to continue
zh_hant: 有新版本

# views.app_lock_screen.keychain
source: Keychain 访问被拒绝
en: Keychain access denied
zh_hant: 將執行基礎環境修復。修復完成後，請手動點選“再次啟動 Gateway”。

# views.app_lock_screen.password_incorrect_retry
source: 密码错误，请重试
en: Incorrect password, please try again.
zh_hant: 檢測到 Node.js 環境缺失

# views.app_lock_screen.touch_id_unlock
source: 使用 Touch ID 解锁
en: Touch ID Unlock
zh_hant: 關閉

# views.app_lock_screen.unlock
source: 解锁
en: Unlock
zh_hant: 當前步驟：%@

# views.app_update_banner.retry
source: 重试
en: Retry
zh_hant: 修復中…

# views.app_update_banner.text_ee19e45e
source: 正在下载 %@%@%@
en: Downloading %@%@%@
zh_hant: 修復進度：%d/4

# views.app_update_banner.update_now
source: 立即更新
en: Update now
zh_hant: 觸發原因：%@

# views.apply_credential_sheet.account_missing_credentials
source: 「%@」未配置凭据，请先在全局模型池中设置
en: "%@" has no credentials configured. Please set them up in the global model pool first.
zh_hant: 再次啟動 Gateway

# views.apply_credential_sheet.account_synced_to_user
source: 「%@」已同步到 %@
en: "%@" has been synced to %@
zh_hant: 開始修復

# views.apply_credential_sheet.auth_profiles_json_keyref_secrets
source: 同步后虾的 auth-profiles.json 将使用 keyRef 格式引用 secrets
en: After syncing, the shrimp's auth-profiles.json will use keyRef format to reference secrets
zh_hant: 模型列表請求失敗：HTTP %d

# views.apply_credential_sheet.configuration_account
source: 尚未配置全局账户
en: No global accounts configured yet
zh_hant: Base URL 無效，無法拉取模型列表

# views.apply_credential_sheet.configuration_credential
source: 未配置凭据
en: No credentials configured
zh_hant: 模型列表請求失敗：無響應狀態

# views.apply_credential_sheet.configurationaccountsync
source: 没有已配置凭据的账户可同步
en: No accounts with configured credentials available to sync
zh_hant: 操作失敗

# views.apply_credential_sheet.done
source: 完成
en: Done
zh_hant: 通用全域性知識庫

# views.apply_credential_sheet.oauth_authorize
source: OAuth 授权
en: OAuth Authorization
zh_hant: 專屬安全空間 — 蝦之間資料互不可見，您決定每隻蝦能接觸哪些檔案。產出物一鍵在 Finder 中查閱，檔案交換盡在掌握

# views.apply_credential_sheet.oauth_authorize_a1326d
source: OAuth 授权功能即将推出
en: OAuth authorization coming soon
zh_hant: 檔案共享

# views.apply_credential_sheet.secrets_openclaw
source: 将全局 secrets 写入虾的 ~/.openclaw/
en: Write global secrets to the shrimp's ~/.openclaw/
zh_hant: 管理密碼

# views.apply_credential_sheet.sync_all
source: 同步全部
en: Sync All
zh_hant: ClawdHome 已鎖定

# views.apply_credential_sheet.sync_credentials
source: 同步凭据
en: Sync Credentials
zh_hant: 請輸入管理密碼以繼續

# views.apply_credential_sheet.sync_failed_detail
source: 同步失败：%@
en: Sync failed: %@
zh_hant: Keychain 訪問被拒絕

# views.apply_credential_sheet.synced_account_count_to_user
source: 已同步 %d 个账户到 %@
en: Synced %d account(s) to %@
zh_hant: 密碼錯誤，請重試

# views.apply_credential_sheet.text_6a620e3c
source: 同步
en: Sync
zh_hant: 使用 Touch ID 解鎖

# views.awakening.display_name_empty
source: 显示名不能为空
en: \u{663E}\u{793A}\u{540D}\u{4E0D}\u{80FD}\u{4E3A}\u{7A7A}
zh_hant: 解鎖

# views.awakening.display_name_taken
source: 显示名 %@ 已被使用，请换一个名字
en: \u{663E}\u{793A}\u{540D} %@ \u{5DF2}\u{88AB}\u{4F7F}\u{7528}\u{FF0C}\u{8BF7}\u{6362}\u{4E00}\u{4E2A}\u{540D}\u{5B57}
zh_hant: 重試

# views.awakening.username_exists
source: 用户名 @%@ 已存在，请换一个再试
en: \u{7528}\u{6237}\u{540D} @%@ \u{5DF2}\u{5B58}\u{5728}\u{FF0C}\u{8BF7}\u{6362}\u{4E00}\u{4E2A}\u{518D}\u{8BD5}
zh_hant: 正在下載 %@%@%@

# views.awakening_wizard_view.about_to_awaken
source: 即将唤醒
en: About to awaken
zh_hant: 立即更新

# views.awakening_wizard_view.awaken_now
source: 正式唤醒 🦞
en: Awaken Now 🦞
zh_hant: 「%@」未配置憑據，請先在全域性模型池中設定

# views.awakening_wizard_view.awakening
source: 唤醒中…
en: Awakening...
zh_hant: 「%@」已同步到 %@

# views.awakening_wizard_view.back
source: ← 返回
en: ← Back
zh_hant: 同步後蝦的 auth-profiles.json 將使用 keyRef 格式引用 secrets

# views.awakening_wizard_view.back_to_edit
source: 返回修改
en: Back to Edit
zh_hant: 尚未配置全域性賬戶

# views.awakening_wizard_view.cancel
source: 取消
en: Cancel
zh_hant: 未配置憑據

# views.awakening_wizard_view.category
source: 分类
en: Category
zh_hant: 沒有已配置憑據的賬戶可同步

# views.awakening_wizard_view.confirm_to_awaken_locally
source: 确认后，TA 将在本地正式落户 🦞
en: After confirmation, it will be fully awakened on your local machine 🦞
zh_hant: 完成

# views.awakening_wizard_view.creating_shrimp_and_starting_wizard
source: 正在创建虾并启动初始化向导…
en: Creating shrimp and starting initialization wizard...
zh_hant: OAuth 授權

# views.awakening_wizard_view.display_name
source: 显示名
en: Display Name
zh_hant: OAuth 授權功能即將推出

# views.awakening_wizard_view.fix_and_retry_hint
source: 请点击“← 返回”修改后重试。
en: Please click “← Back” to edit and try again.
zh_hant: 將全域性 secrets 寫入蝦的 ~/.openclaw/

# views.awakening_wizard_view.identity_title
source: 身份设定
en: Identity
zh_hant: 同步全部

# views.awakening_wizard_view.independent_macos_username
source: 独立 macOS 用户名（安全隔离）
en: Independent macOS Username (Security Isolation)
zh_hant: 同步憑據

# views.awakening_wizard_view.name_your_companion
source: 给 TA 起个名字
en: Name your companion
zh_hant: 同步失敗：%@

# views.awakening_wizard_view.next
source: 下一步 →
en: Next →
zh_hant: 已同步 %d 個賬戶到 %@

# views.awakening_wizard_view.os_username
source: OS 用户名
en: OS Username
zh_hant: 同步

# views.awakening_wizard_view.os_username_error
source: 以字母开头，只允许字母、数字、下划线
en: Must start with a letter and contain only letters, digits, or underscores
zh_hant: 顯示名不能為空

# views.awakening_wizard_view.privacy_banner
source: 您正在将此数字生命基因从云端下载到您的本地设备。所有后续数据交互、知识库构建都将发生在您的物理节点内，绝对隐私，云端隔离。
en: You are downloading this digital companion's DNA from the cloud to your local device. All subsequent data interactions and knowledge-base building will happen on your physical node, with full privacy and cloud isolation.
zh_hant: 顯示名 %@ 已被使用，請換一個名字

# views.awakening_wizard_view.role_display_name
source: 角色显示名称
en: Role Display Name
zh_hant: 使用者名稱 @%@ 已存在，請換一個再試

# views.awakening_wizard_view.role_prototype
source: 角色原型
en: Role Prototype
zh_hant: 即將喚醒

# views.awakening_wizard_view.soul_title
source: 核心价值观
en: Core Values
zh_hant: 正式喚醒 🦞

# views.awakening_wizard_view.system_username
source: 系统用户名
en: System Username
zh_hant: 喚醒中…

# views.awakening_wizard_view.user_title
source: 我的画像
en: User Profile
zh_hant: ← 返回

# views.awakening_wizard_view.usually_takes_3_8_seconds
source: 通常需要 3-8 秒，请稍候
en: This usually takes 3–8 seconds. Please wait.
zh_hant: 返回修改

# views.backup_manager_sheet.text_f8ebb8c7
source: %@ 个备份
en: %@ Backups
zh_hant: 取消

# views.backup_view.text_50f6634f
source: 备份记录（%@）
en: Backups (%@)
zh_hant: 分類

# views.channel_onboarding.allow_from_placeholder
source: 每行一个用户 ID，如 ou_xxxx
en: One user ID per line, e.g. ou_xxxx
zh_hant: 正在建立蝦並啟動初始化嚮導…

# views.channel_onboarding.cancel
source: 取消
en: Cancel
zh_hant: 顯示名

# views.channel_onboarding.config_streaming
source: 流式输出
en: Streaming Output
zh_hant: 請點選“← 返回”修改後重試。

# views.channel_onboarding.config_streaming_detail
source: 消息以流式卡片实时更新，而非等待完成后一次性发送
en: Messages update in real-time via streaming cards instead of sending all at once after completion
zh_hant: 身份設定

# views.channel_onboarding.config_topic_session
source: 话题独立上下文
en: Topic Independent Context
zh_hant: 獨立 macOS 使用者名稱（安全隔離）

# views.channel_onboarding.config_topic_session_detail
source: 开启后话题群中的每个话题拥有独立上下文，支持多任务并行
en: When enabled, each topic in a group chat has independent context, supporting parallel tasks
zh_hant: 給 TA 起個名字

# views.channel_onboarding.configured
source: 已配置
en: Configured
zh_hant: 下一步 →

# views.channel_onboarding.feishu_channel_onboarding_sheet.exit_num_retry
source: 命令已退出（exit %d）。请查看上方终端输出并重试。
en: Command exited (exit %d). Please check the terminal output above and retry.
zh_hant: OS 使用者名稱

# views.channel_onboarding.group_allow_from_placeholder
source: 每行一个群组 ID
en: One group ID per line
zh_hant: 以字母開頭，只允許字母、數字、下劃線

# views.channel_onboarding.loading
source: 加载中…
en: Loading…
zh_hant: 您正在將此數字生命基因從雲端下載到您的本地裝置。所有後續資料互動、知識庫構建都將發生在您的物理節點內，絕對隱私，雲端隔離。

# views.channel_onboarding.rebind
source: 重新绑定
en: Re-bind
zh_hant: 角色顯示名稱

# views.channel_onboarding.rebind_confirm_message
source: 将重新执行配对流程，生成新的二维码进行扫码绑定。
en: This will restart the pairing process and generate a new QR code for scanning.
zh_hant: 角色原型

# views.channel_onboarding.rebind_confirm_title
source: 确认重新绑定？
en: Confirm Re-bind?
zh_hant: 核心價值觀

# views.channel_onboarding.reload
source: 重新加载
en: Reload
zh_hant: 系統使用者名稱

# views.channel_onboarding.save
source: 保存
en: Save
zh_hant: 我的畫像

# views.channel_onboarding.save_failed
source: 保存失败：%@
en: Save failed: %@
zh_hant: 通常需要 3-8 秒，請稍候

# views.channel_onboarding.saved
source: 已保存
en: Saved
zh_hant: %@ 個備份

# views.channel_onboarding.saving
source: 保存中…
en: Saving…
zh_hant: 備份記錄（%@）

# views.channel_onboarding.weixin_no_config_needed
source: 微信通道无需填写 App ID 或 Allowlist，扫码绑定成功后即可使用。
en: WeChat channel does not require App ID or Allowlist. Ready to use after QR code pairing.

# views.channel_onboarding.window_title
source: %@ · %@ 通道配置 · %@
en: %@ · %@ Channel Config · %@
zh_hant: 每行一個使用者 ID，如 ou_xxxx

# views.cliconfig_step.back_to_terminal_entry
source: 返回终端入口
en: Back to terminal entry
zh_hant: 取消

# views.cliconfig_step.configuration
source: 在终端配置（推荐）
en: Configure in Terminal (Recommended)
zh_hant: 流式輸出

# views.cliconfig_step.configuration_2525b2
source: 在此配置（实验性）
en: Configure Here (Experimental)
zh_hant: 訊息以流式卡片即時更新，而非等待完成後一次性發送

# views.cliconfig_step.configuration_5e18b6
source: 改用界面配置 ⚠️ 实验性
en: Use GUI Configuration Instead ⚠️ Experimental
zh_hant: 話題獨立上下文

# views.cliconfig_step.configuration_configuration
source: 界面配置功能尚不成熟，建议使用终端配置
en: GUI configuration is not yet mature. Terminal configuration is recommended.
zh_hant: 開啟後話題群中的每個話題擁有獨立上下文，支援多工並行

# views.cliconfig_step.configuration_openclaw
source: 配置 openclaw
en: Configure openclaw
zh_hant: 已配置

# views.cliconfig_step.done_configuration
source: 终端已打开，在终端完成配置后回到此处。
en: Terminal is open. Return here after completing the configuration in Terminal.
zh_hant: 命令已退出（exit %d）。請檢視上方終端輸出並重試。

# views.cliconfig_step.done_configuration_4880fd
source: 已完成配置
en: Configuration Complete
zh_hant: 每行一個群組 ID

# views.cliconfig_step.password_hint
source: 提示：接下来请输入 %@ 的 Mac 登录密码
en: Hint: You will be prompted to enter the Mac login password for %@
zh_hant: 載入中…

# views.cliconfig_step.reopen_terminal
source: 重新打开终端
en: Reopen Terminal
zh_hant: 重新繫結

# views.cliconfig_step.terminal_close_hint
source: 按 Return 键关闭此窗口...
en: Press Return to close this window...
zh_hant: 將重新執行配對流程，生成新的二維碼進行掃碼繫結。

# views.cliconfig_step.terminal_failed
source: 配置出现错误（退出码 $_exit），请检查输出并重试。
en: Configuration error (exit code $_exit). Please check the output and retry.
zh_hant: 確認重新繫結？

# views.cliconfig_step.terminal_success
source: 配置完成。请返回 ClawdHome 点击「已完成配置」。
en: Configuration complete. Please return to ClawdHome and click "Configuration Complete".
zh_hant: 重新載入

# views.cliconfig_step.terminal_title
source: === ClawdHome: 配置用户 %@ ===
en: === ClawdHome: Configure User %@ ===
zh_hant: 儲存

# views.clone_claw_sheet.cancel_clone
source: 终止克隆
en: Cancel Clone
zh_hant: 儲存失敗：%@

# views.clone_claw_sheet.cancel_failed
source: 终止克隆失败：%@
en: Failed to cancel clone: %@
zh_hant: 已儲存

# views.clone_claw_sheet.cancel_requested
source: 已请求终止克隆，正在停止…
en: Cancel requested. Stopping clone...
zh_hant: 儲存中…

# views.clone_claw_sheet.cancelling
source: 终止中…
en: Cancelling...
zh_hant: 微信通道無需填寫 App ID 或 Allowlist，掃碼繫結成功後即可使用。

# views.clone_claw_sheet.current_status
source: 当前状态：%@
en: Current status: %@
zh_hant: %@ · %@ 通道配置 · %@

# views.clone_claw_sheet.text_70867500
source: 预计复制总量：%@
en: Estimated total size: %@
zh_hant: 返回終端入口

# views.clone_claw_sheet.text_985cdafc
source: 扫描失败：%@
en: Scan failed: %@
zh_hant: 在終端配置（推薦）

# views.clone_claw_sheet.text_c6c6eeb2
source: 克隆失败：%@
en: Clone failed: %@
zh_hant: 在此配置（實驗性）

# views.clone_claw_sheet.text_f0485c5e
source: 来源：@%@
en: Source: @%@
zh_hant: 改用介面配置 ⚠️ 實驗性

# views.config_editor_sheet.cancel
source: 取消
en: Cancel
zh_hant: 介面配置功能尚不成熟，建議使用終端配置

# views.config_editor_sheet.claude_api
source: 用于访问 Claude API。留空则保持现有值不变。
en: Used to access the Claude API. Leave empty to keep the current value.
zh_hant: 配置 openclaw

# views.config_editor_sheet.configuration_save
source: 配置已保存
en: Configuration saved
zh_hant: 終端已開啟，在終端完成配置後回到此處。

# views.config_editor_sheet.gateway
source: Gateway 模式
en: Gateway
zh_hant: 已完成配置

# views.config_editor_sheet.local
source: local：在本机运行（推荐家庭使用）
en: local: Run on this machine (recommended for home use)
zh_hant: 提示：接下來請輸入 %@ 的 Mac 登入密碼

# views.config_editor_sheet.save
source: 保存中…
en: Saving...
zh_hant: 重新開啟終端

# views.config_editor_sheet.save_be5fbb
source: 保存
en: Save
zh_hant: 按 Return 鍵關閉此視窗...

# views.config_editor_sheet.text_44c4aaa1
source: 运行模式
en: Run mode
zh_hant: 配置出現錯誤（退出碼 $_exit），請檢查輸出並重試。

# views.config_editor_sheet.text_873f12d4
source: 配置 — @%@
en: Configuration — @%@
zh_hant: 配置完成。請返回 ClawdHome 點選「已完成配置」。

# views.config_tab_view.footer_hint
source: 编辑 .openclaw/openclaw.json 主配置。保存后将自动重启 Gateway 使配置生效。JSON 校验错误时保存按钮将禁用。
en: Edit .openclaw/openclaw.json main configuration. Gateway will auto-restart after saving. Save button is disabled when JSON validation fails.
zh_hant: === ClawdHome: 配置使用者 %@ ===

# views.config_tab_view.save_and_restart
source: 保存并重启 Gateway
en: Save & Restart Gateway
zh_hant: 終止克隆

# views.config_tab_view.saving
source: 保存中…
en: Saving…
zh_hant: 終止克隆失敗：%@

# views.custom_provider.api_key_placeholder
source: 留空则尝试使用 CUSTOM_API_KEY
en: Leave empty to use CUSTOM_API_KEY
zh_hant: 已請求終止克隆，正在停止…

# views.custom_provider.fetch_from_api
source: 从 API 拉取列表
en: Fetch from API
zh_hant: 終止中…

# views.custom_provider.fetching
source: 拉取中…
en: Fetching…
zh_hant: 當前狀態：%@

# views.custom_provider.invalid_base_url
source: 请先填写有效的 Base URL
en: Please enter a valid Base URL first
zh_hant: 預計複製總量：%@

# views.custom_provider.model_id_placeholder
source: 输入模型 ID（例如 gpt-5.5 / claude-opus-4-7）
en: Enter model ID (e.g. gpt-5.5 / claude-opus-4-7)
zh_hant: 掃描失敗：%@

# views.custom_provider.models_fetched
source: 已拉取 %d 个模型
en: Fetched %d models
zh_hant: 克隆失敗：%@

# views.custom_provider.no_models_found
source: 已请求成功，但未解析到可用模型 ID（该接口可能不支持标准 list）
en: Request succeeded but no model IDs found (endpoint may not support standard list)
zh_hant: 來源：@%@

# views.daemon_setup.restart_failed
source: 重启失败，请手动运行：sudo launchctl kickstart -k system/ai.clawdhome.mac.helper
en: Restart failed. Run manually: sudo launchctl kickstart -k system/ai.clawdhome.mac.helper
zh_hant: 取消

# views.daemon_setup.restart_helper
source: 重启 Helper
en: Restart Helper
zh_hant: 用於訪問 Claude API。留空則保持現有值不變。

# views.daemon_setup.restarting
source: 重启中…
en: Restarting…
zh_hant: 配置已儲存

# views.detail.channel_count
source: 已配置 %d 个频道
en: %d channels configured
zh_hant: Gateway 模式

# views.detail.config_mode_builtin
source: 内置 UI
en: Built-in UI
zh_hant: local：在本機執行（推薦家庭使用）

# views.detail.config_mode_cli
source: 更多模型（命令行）
en: More Models (CLI)
zh_hant: 儲存中…

# views.detail.custom_fetch_empty
source: 已请求成功，但未解析到可用模型 ID（该接口可能不支持标准 list）
en: Request succeeded but no model IDs found (endpoint may not support standard list)
zh_hant: 儲存

# views.detail.custom_fetch_list
source: 从 API 拉取列表
en: Fetch from API
zh_hant: 執行模式

# views.detail.custom_fetch_success
source: 已拉取 %d 个模型
en: Fetched %d models
zh_hant: 配置 — @%@

# views.detail.custom_fetching
source: 拉取中…
en: Fetching…
zh_hant: 編輯 .openclaw/openclaw.json 主配置。儲存後將自動重啟 Gateway 使配置生效。JSON 校驗錯誤時儲存按鈕將停用。

# views.detail.duration_days_hours
source: %d天 %d小时
en: %dd %dh
zh_hant: 儲存並重啟 Gateway

# views.detail.duration_hours_minutes
source: %d小时 %d分钟
en: %dh %dm
zh_hant: 儲存中…

# views.detail.duration_minutes
source: %d分钟
en: %dm
zh_hant: 留空則嘗試使用 CUSTOM_API_KEY

# views.detail.error_fill_base_url
source: 请先填写 Base URL
en: Please fill in Base URL first
zh_hant: 從 API 拉取列表

# views.detail.error_select_model
source: 请先选择模型
en: Please select a model first
zh_hant: 拉取中…

# views.detail.promo_minimax
source: 🎁 领取 9 折专属优惠
en: 🎁 Get exclusive 10% off
zh_hant: 請先填寫有效的 Base URL

# views.detail.promo_qiniu
source: 免费领取 1000 万 Token
en: Get 10 million free tokens
zh_hant: 輸入模型 ID（例如 gpt-5.5 / claude-opus-4-7）

# views.detail.promo_zai
source: 95折优惠订阅
en: 5% off subscription
zh_hant: 已拉取 %d 個模型

# views.detail.provider_custom
source: 自定义
en: Custom
zh_hant: 已請求成功，但未解析到可用模型 ID（該介面可能不支援標準 list）

# views.detail.provider_custom_api_key
source: 自定义 API Key
en: Custom API Key
zh_hant: 重啟失敗，請手動執行：sudo launchctl kickstart -k system/ai.clawdhome.mac.helper

# views.detail.provider_custom_placeholder
source: 留空则尝试使用 CUSTOM_API_KEY
en: Leave empty to use CUSTOM_API_KEY
zh_hant: 重啟 Helper

# views.detail.provider_qiniu_console
source: 七牛 API Key
en: Qiniu API Key
zh_hant: 重啟中…

# views.detail.provider_zai
source: 智谱 Z.AI
en: Zhipu Z.AI
zh_hant: 已配置 %d 個頻道

# views.detail.provider_zai_api_key
source: 智谱 API Key
en: Zhipu API Key
zh_hant: 內建 UI

# views.detail.provider_zai_console
source: 获取 API Key
en: Get API Key
zh_hant: 更多模型（命令列）

# views.detail.repair.step_done
source: 修复完成，等待再次启动
en: Repair complete, waiting to restart
zh_hant: 已請求成功，但未解析到可用模型 ID（該介面可能不支援標準 list）

# views.detail.repair.step_healthcheck
source: 执行体检修复
en: Run health check repair
zh_hant: 從 API 拉取列表

# views.detail.repair.step_homebrew
source: 修复 Homebrew 权限
en: Repair Homebrew permissions
zh_hant: 已拉取 %d 個模型

# views.detail.repair.step_node
source: 安装/修复 Node.js
en: Install/repair Node.js
zh_hant: 拉取中…

# views.detail.repair.step_npm
source: 配置 npm 目录
en: Configure npm directory
zh_hant: %d天 %d小時

# views.detail.repair.step_starting
source: 正在启动 Gateway
en: Starting Gateway
zh_hant: %d小時 %d分鐘

# views.detail.skill_cancel
source: 取消
en: Cancel
zh_hant: %d分鐘

# views.detail.skill_disabled_in_config
source: 已在配置中禁用
en: Disabled in configuration
zh_hant: 請先填寫 Base URL

# views.detail.skill_get_key
source: 获取密钥 →
en: Get Key →
zh_hant: 請先選擇模型

# views.detail.skill_install
source: 安装
en: Install
zh_hant: 🎁 領取 9 折專屬優惠

# views.detail.skill_missing_bins
source: 缺少二进制: %@
en: Missing binary: %@
zh_hant: 免費領取 1000 萬 Token

# views.detail.skill_missing_config
source: 需要配置: %@
en: Configuration required: %@
zh_hant: 95折優惠訂閱

# views.detail.skill_missing_env
source: 缺少环境变量: %@
en: Missing environment variable: %@
zh_hant: 自定義

# views.detail.skill_save
source: 保存
en: Save
zh_hant: 自定義 API Key

# views.detail.skill_save_hint
source: 保存至 openclaw.json 中 skills.entries.%@
en: Save to openclaw.json at skills.entries.%@
zh_hant: 留空則嘗試使用 CUSTOM_API_KEY

# views.detail.skill_set_api_key
source: 设置 API Key
en: Set API Key
zh_hant: 七牛 API Key

# views.detail.skill_set_env
source: 设置 %@
en: Set %@
zh_hant: 智譜 Z.AI

# views.detail.skill_set_env_var
source: 设置环境变量
en: Set Environment Variable
zh_hant: 智譜 API Key

# views.detail.skill_uninstall
source: 卸载
en: Uninstall
zh_hant: 獲取 API Key

# views.detail.skill_uninstall_confirm
source: 卸载 %@？
en: Uninstall %@?
zh_hant: 修復完成，等待再次啟動

# views.detail.skill_website
source: 网站
en: Website
zh_hant: 執行體檢修復

# views.detail.skills_auto_enable_hint
source: 满足依赖条件（二进制、环境变量、配置）后自动启用
en: Automatically enabled when dependencies (binary, env vars, config) are met
zh_hant: 修復 Homebrew 許可權

# views.detail.skills_empty
source: 暂无 Skills
en: No Skills
zh_hant: 安裝/修復 Node.js

# views.detail.skills_filter
source: 筛选
en: Filter
zh_hant: 配置 npm 目錄

# views.detail.skills_filter_all
source: 全部
en: All
zh_hant: 正在啟動 Gateway

# views.detail.skills_filter_disabled
source: 已禁用
en: Disabled
zh_hant: 取消

# views.detail.skills_filter_needs_setup
source: 需配置
en: Needs Setup
zh_hant: 已在配置中停用

# views.detail.skills_filter_ready
source: 就绪
en: Ready
zh_hant: 獲取金鑰 →

# views.detail.skills_get_more
source: 获取更多 Skills
en: Get More Skills
zh_hant: 安裝

# views.detail.skills_no_match
source: 没有匹配的 Skills
en: No matching Skills
zh_hant: 缺少二進位制: %@

# views.detail.skills_no_token
source: 未获取到可用 Token，请先确认 Gateway 已启动并就绪。
en: No available token found. Please ensure Gateway is running and ready.
zh_hant: 需要配置: %@

# views.detail.skills_preparing
source: 准备中…
en: Preparing…
zh_hant: 缺少環境變數: %@

# views.detail.skills_refresh
source: 刷新
en: Refresh
zh_hant: 儲存

# views.detail.skills_search
source: 搜索 Skills…
en: Search Skills…
zh_hant: 儲存至 openclaw.json 中 skills.entries.%@

# views.detail.skills_store_close
source: 关闭
en: Close
zh_hant: 設定 API Key

# views.detail.skills_store_error
source: 无法打开 Skills 商店
en: Unable to open Skills Store
zh_hant: 設定 %@

# views.detail.skills_store_open_browser
source: 浏览器打开
en: Open in Browser
zh_hant: 設定環境變數

# views.detail.skills_store_reload
source: 重载
en: Reload
zh_hant: 解除安裝

# views.detail.skills_store_title
source: Skills 商店
en: Skills Store
zh_hant: 解除安裝 %@？

# views.diagnostics.checked_at
source: 检查于 %@
en: Checked at %@
zh_hant: 網站

# views.diagnostics.critical_count
source: %d 个严重问题
en: %d critical issues
zh_hant: 滿足依賴條件（二進位制、環境變數、配置）後自動啟用
